{"data":{"markdownRemark":{"id":"e1361d3d-4c2f-5f5b-8d1e-d594382f160f","html":"<h2>APPENDIX B: Software design</h2>\n<h3>Modular structure</h3>\n<p>Many tutorials introduce you a monolithic application structure: put all application state in this directory, put all application actions into another directory. This works ok for a very small application, but it starts to become problematic once the codebase grows larger. Another approach would be to split the frontend into separate micro frontends and the backend into separate microservices. But this can be a bit overkill approach for a small application or API. When in doubt, a monolithic implementation with a modular structure is often the best approach for quickly building the first MVP or prototype. When done correctly, the modular structure can easily be split into separate micro frontends and microservices once required.</p>\n<p>Whether you are building a monolithic implementation or separate micro frontends and microservices, an application or API codebase should always be divided into loosely coupled highly cohesive parts by using a modular structure. Even if the monolithic implementation is not going to be split into micro frontends and microservices later, the modular structure provides many benefits, for example:</p>\n<ul>\n<li>When making a change, it's easier to see how widely the change might affect the application.</li>\n<li>When implementing a new feature, there is no need to jump around in the codebase as much.</li>\n<li>It's easier for a new developer to implement new features without knowing the whole codebase.</li>\n<li>Once the application grows and time passes, it's easier to rewrite some parts of the application using a newer technology without affecting the other parts.</li>\n</ul>\n<p>The following guidelines usually work well when building a modular monolithic implementation:</p>\n<ul>\n<li>Create directory structure mainly based on domain concepts or features (<code class=\"language-text\">billing</code>, <code class=\"language-text\">management</code>, <code class=\"language-text\">trip</code>, ...) instead of technical type or layer (<code class=\"language-text\">actions</code>, <code class=\"language-text\">containers</code>, <code class=\"language-text\">components</code>, <code class=\"language-text\">css</code>, <code class=\"language-text\">utils</code>, ...).</li>\n<li>You can use event-based communication to avoid direct calls between loosely coupled parts. That is, one UI section or service produces events that the others can listen to, if they are interested in such an event.</li>\n<li>Use such file naming that you can easily determine the type from a filename (e.g. <code class=\"language-text\">*.util.js</code>, <code class=\"language-text\">*.api.js</code>). This way you don't need to use additional directories for grouping files by type. Thus, you can freely place a file wherever it is needed. NOTE: It is ok to exclude type from GUI component filenames to keep import statements shorter. Just make sure that you can easily determine type and responsibility from a filename, and that you use the same naming convention throughout the codebase.</li>\n<li>A directory should not contain any references outside of its boundary; with the exception of references to libraries and common directories. You can think of each directory as an independent concept (or subconcept), and each <code class=\"language-text\">common</code> directory as a library that is shared among closely related concepts (or subconcepts).</li>\n<li>A file should contain only nearby references (e.g. references to files in the same directory or in a subdirectory directly beneath it); with the exception of references to libraries and common directories, of course.</li>\n<li>If you break the guidelines, at least try to avoid making circular dependencies. Also leave a <code class=\"language-text\">REFACTOR:</code> comment if the dependency is the kind that it should be refactored later.</li>\n</ul>\n<p>See <a href=\"https://github.com/TaitoUnited/server-template/tree/master/client/src\">full-stack-template/client/src</a> as an example.</p>\n<p>TODO: DRY, KISS, YAGNI, GRASP, SOLID\nTODO: <a href=\"https://jaxenter.com/promising-new-metric-track-maintainability-154195.html\">https://jaxenter.com/promising-new-metric-track-maintainability-154195.html</a>\nTODO: <a href=\"https://www.tutorialspoint.com/software_engineering/software_design_basics.htm\">https://www.tutorialspoint.com/software<em>engineering/software</em>design_basics.htm</a></p>\n<h3>API design</h3>\n<p>REST and GraphQL API implementations should be stateless. Stateless means that a service does not keep any state in memory or on local disk between requests. That is, all state resides either on UI, on database, or on some other external system. Services should be stateless because multiple instances of the same service will be run in parallel, and the request that an UI or 3rd party system makes, may be forwarded to any them. In addition, you should be able to publish a new version of the service any time without causing interruptions, which is harder to do if service is stateful. A stateless service should not:</p>\n<ul>\n<li>Cache data in local memory (tip: use Redis as cache, or keep state in UI and use JWT tokens if necessary)</li>\n<li>Use local disk for permanent data (tip: use object storage buckets)</li>\n<li>Define request rate limits (tip: define rate limits in Kubernetes ingress)</li>\n<li>Use local timers to execute jobs (tip: use Kubernetes cron jobs)</li>\n<li>TODO stateless websockets</li>\n</ul>\n<h4>RESTful API design</h4>\n<p>Some good articles on REST API design:</p>\n<ul>\n<li><a href=\"http://www.vinaysahni.com/best-practices-for-a-pragmatic-restful-api\">best-practices-for-a-pragmatic-restful-api</a></li>\n<li><a href=\"https://blog.mwaysolutions.com/2014/06/05/10-best-practices-for-better-restful-api/\">10-best-practices-for-better-restful-api</a></li>\n<li><a href=\"https://cloudplatform.googleblog.com/2017/10/API-design-choosing-between-names-and-identifiers-in-URLs.html\">API-design-choosing-between-names-and-identifiers-in-URLs</a></li>\n<li><a href=\"https://cloud.google.com/apis/design/\">Google API Design Guide</a></li>\n<li><a href=\"http://jsonapi.org/\">jsonapi.org</a>: Remember KISS principle! JSON API seems to be a bit over-engineered for the needs of a simple web application, but provides some good ideas.</li>\n<li><a href=\"http://apiux.com/2014/09/05/api-design-sustainability/\">How to design APIs that last</a></li>\n<li><a href=\"http://www.slideshare.net/JasonHarmon1/api-design-antipatterns-54493635\">API design anti-patterns</a></li>\n</ul>\n<h4>GraphQL API design</h4>\n<p>TODO</p>\n<h3>Relational database design</h3>\n<ul>\n<li><a href=\"http://www.datanamic.com/support/lt-dez005-introduction-db-modeling.html\">introduction-db-modeling</a></li>\n<li><a href=\"http://www.vertabelo.com/blog/technical-articles/7-common-database-design-errors\">7-common-database-design-errors</a></li>\n<li><a href=\"https://www.simple-talk.com/sql/database-administration/how-to-get-database-design-horribly-wrong/\">how-to-get-database-design-horribly-wrong</a></li>\n<li><a href=\"https://www.simple-talk.com/sql/database-administration/five-simple-database-design-errors-you-should-avoid/\">five-simple-database-design-errors-you-should-avoid</a></li>\n<li><a href=\"https://edn.embarcadero.com/article/40466\">Seven Deadly Sins of Database Design</a></li>\n</ul>\n<p>TODO: conventions for audit log and/or journal tables. Take GDPR into account.</p>\n<h3>TODO some copy-pasted old text</h3>\n<h4>Structure</h4>\n<p>Think about the following concepts while you are working with your project. You can apply them no matter whether you are working with services, modules, directories, classes or just plain methods and functions. Do not blindly follow structure shown on tutorials or starter templates since those are really meant for quick start only.</p>\n<ul>\n<li><strong>Loose coupling:</strong> Aim for loose coupling between different parts by defining a clear contract between the parts, minimizing the number of dependencies and avoiding circular dependencies altogether.</li>\n<li><strong>High cohesion:</strong> Aim for high cohesion by putting closely related logic in the same place.</li>\n<li><strong>Responsibility:</strong> Name the part according to its responsibility. The part should implement only such logic that it's responsible for and nothing else!</li>\n</ul>\n<p>See <a href=\"https://github.com/TaitoUnited/server-template\">server-template</a> as an example of a directory structure. This kind of loosely coupled modular structure has many benefits including:</p>\n<ul>\n<li>When you make changes to an existing implementation, you know better how widely the change will affect the rest of the application (what might break).</li>\n<li>When you make changes to a feature, you don't have to jump around in the code tree searching for the correct places that you need to change.</li>\n<li>If you just started in the project as a new developer, you don't have to understand the whole application; only the loosely coupled parts that you are working with.</li>\n<li>It is easier to write and maintain unit/integration tests.</li>\n<li>If the application has grown large, it is easier to split it into parts that are deployed to server or loaded to browser independently.</li>\n<li>If the application is old, it is easier to develop new features using a modern technology and migrate old parts one by one only when it is really necessary.</li>\n</ul>\n<h4>Naming</h4>\n<p>As stated previously, each part should be named according to its responsibility. But naming can be hard. The following resources might provide some help in finding well established common terminology. Knowing the most commonly used design patterns doesn't hurt either, but there is no need to learn all of them.</p>\n<ul>\n<li>TODO modern terminology: ...</li>\n<li>TODO basic terminology: service, dao, repository, ...</li>\n<li><a href=\"http://www.blackwasp.co.uk/gofpatterns.aspx\">GoF Design Patterns</a></li>\n</ul>\n<h4>Tips</h4>\n<ul>\n<li>Avoid premature optimization. During implementation of a single feature, it's best to invest on code maintainability and optimize only if it's really necessary. More often than not optimization requires additional work and weakens maintainability.</li>\n</ul>\n<hr>\n<p><strong>Next:</strong> <a href=\"c-modern-server-infrastructure\">APPENDIX C: Modern server infrastructure</a></p>"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"e1361d3d-4c2f-5f5b-8d1e-d594382f160f"}}