{"data":{"markdownRemark":{"id":"bd20f397-0a6c-560f-b015-849a5c4cc39e","html":"<h1>PART IV: Zones</h1>\n<h2>15. Creating a zone</h2>\n<blockquote>\n<p>WARNING: Instructions not up-to-date.</p>\n</blockquote>\n<ol>\n<li>\n<p>Create a user account to one of the cloud service platforms. For now, you should choose Google Cloud because Taito CLI support for other cloud providers is still work-in-progress. As a new Google Cloud user you get €300 worth of cloud services for free, so trying will cost you nothing. Go to <a href=\"https://console.cloud.google.com\">Google Cloud console</a> and log in with your Google user account.</p>\n</li>\n<li>\n<p>Register a domain name, and get a DNS service for configuring IP addresses for the domain. If you don't have these already, you can buy an affordable domain name from <a href=\"https://www.namecheap.com/\">namecheap</a>. Namecheap provides also <a href=\"https://www.namecheap.com/domains/freedns/\">DNS</a>, but since you already have a Google Cloud account, you can also use the <a href=\"https://cloud.google.com/dns/docs/\">Google Cloud DNS</a> with your domain name.</p>\n</li>\n<li>\n<p>Create a taito zone based on the Google Cloud example with the following commands. Replace <code class=\"language-text\">EDIT</code> with your favorite editor. (TODO: zone create: TEMPLATE)</p>\n<div class=\"gatsby-highlight\" data-language=\"shell\"><pre class=\"language-shell\"><code class=\"language-shell\"><span class=\"token function\">cp</span> -r taito-cli/examples/zones/gcloud my-zone\n<span class=\"token function\">cd</span> my-zone\nEDIT taito-config.sh\ntaito zone apply</code></pre></div>\n</li>\n</ol>\n<p>A <strong>taito zone</strong> provides an infrastructure that your projects are deployed on. The Google Cloud example creates you Kubernetes and PostgreSQL clusters among other things. You usually have at least two <strong>taito zones</strong>: one for development and testing purposes, and an another one for production usage. In these exercises, however, you require only one <strong>taito zone</strong>.</p>\n<p>Do not confuse taito zones with cloud provider regions and zones. One <strong>taito zone</strong> may use multiple cloud provider regions and zones to achieve high availability and regional resiliency.</p>\n<p>If you want to know more, see <a href=\"c-modern-server-infrastructure\">Appendix C: Modern server infrastructure</a>.</p>\n<p>TODO:</p>\n<ul>\n<li>use some text from the old example.</li>\n<li>optional: setup remote state for Terraform</li>\n</ul>\n<hr>\n<p><strong>Next:</strong> <a href=\"/tutorial/16-zone-maintenance\">16. Zone maintenance</a></p>"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"bd20f397-0a6c-560f-b015-849a5c4cc39e"}}