{"data":{"markdownRemark":{"id":"e8275959-2974-5f20-9ecf-9d6ab006f5f8","html":"<h1>Templates</h1>\n<h2>Infrastructure templates</h2>\n<p>Taito CLI comes with some simple <a href=\"https://github.com/TaitoUnited/taito-cli/tree/master/examples/zones/README\">infrastucture templates</a> that you can use as an example to set up your infrastructure. You may also find more infrastructure templates on <a href=\"TODO\">GitHub</a>.</p>\n<h2>Project templates</h2>\n<p>Officially recommended project templates are listed below. All of them include taito configurations for Taito CLI, Terraform scripts for infrastucture management, and build scripts for CI/CD. You may also find more project templates preconfigured for Taito CLI on <a href=\"https://github.com/search?q=topic%3Ataito-template&#x26;type=Repositories\">GitHub</a>.</p>\n<ul>\n<li>\n<p><a href=\"https://github.com/TaitoUnited/server-template\">full-stack-template</a>: Template for applications and APIs running on Kubernetes, Docker Compose, serverless functions, or virtual machine. You can choose the stack during project creation. Support for event-driven microservices (Kafka) and Istio service mesh coming soon.</p>\n</li>\n<li>\n<p><a href=\"https://github.com/TaitoUnited/website-template\">website-template</a>: Template for websites generated with a static site generator (e.g. Gatsby, Hugo or Jekyll), and running on CDN, Kubernetes, Docker Compose, or virtual machine. Supports an automated multistage publishing process. Netlify CMS support also coming soon. You can easily run the <a href=\"https://github.com/TaitoUnited/server-template\">full-stack-template</a> alongside with this template to implement dynamic functionality to your website.</p>\n</li>\n<li>\n<p><a href=\"https://github.com/TaitoUnited/wordpress-template\">wordpress-template</a>: Template for WordPress sites running on Kubernetes, Docker Compose, or virtual machine. You can easily run the <a href=\"https://github.com/TaitoUnited/server-template\">full-stack-template</a> alongside with this template to implement dynamic non-PHP functionality to your website.</p>\n</li>\n<li>\n<p><a href=\"https://github.com/TaitoUnited/react-native-template\">react-native-template</a>: Template for react-native applications. Visual Studio App Center for CI/CD and monitoring.</p>\n</li>\n<li>\n<p><a href=\"https://github.com/TaitoUnited/npm-template\">npm-template</a>: Template for npm libraries. Includes monorepo support.</p>\n</li>\n<li>\n<p>TODO flutter</p>\n</li>\n<li>\n<p>TODO machine learning, kubeflow</p>\n</li>\n<li>\n<p>TODO data warehouse, analytics</p>\n</li>\n<li>\n<p>TODO desktop: electron, javafx, ...</p>\n</li>\n<li>\n<p>TODO tool-template</p>\n</li>\n</ul>"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"e8275959-2974-5f20-9ecf-9d6ab006f5f8"}}